Revit 2027 API
TextRange.Length Property
 The length of the range.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int Length { get; set; }
Public Property Length As Integer
	Get
	Set
public:
property int Length {
	int get ();
	void set (int value);
}
member Length : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for length is negative.
See Also
Reference
TextRange Class
Autodesk.Revit.DB Namespace